In [25]:
salestrain = '/home/vant/Escritorio/ProyectosKaggle/sales_train.csv.gz'

In [26]:
%%time 
!zcat {salestrain} |wc -l

2935850
CPU times: user 26 ms, sys: 12.1 ms, total: 38.1 ms
Wall time: 680 ms

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import plotly as py
%matplotlib inline

In [27]:
pd.options.display.max_columns=None
dfs = pd.read_csv(salestrain, parse_dates=[0], nrows=100000)
dfs.head()

        date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0 2013-02-01               0       59    22154      999.00           1.0
1 2013-03-01               0       25     2552      899.00           1.0
2 2013-05-01               0       25     2552      899.00          -1.0
3 2013-06-01               0       25     2554     1709.05           1.0
4 2013-01-15               0       25     2555     1099.00           1.0

In [21]:
dfs.count() #not missing data !NA

date              100000
date_block_num    100000
shop_id           100000
item_id           100000
item_price        100000
item_cnt_day      100000
dtype: int64

In [28]:
dfs.dtypes #each one is at least a number

date              datetime64[ns]
date_block_num             int64
shop_id                    int64
item_id                    int64
item_price               float64
item_cnt_day             float64
dtype: object

In [23]:
dfs.shape

(100000, 6)

In [24]:
dfs.describe() #it seems date_blocl_num doesn't help anything because each rows is = 0 so I will drop it out

,date_block_num,shop_id,item_id,item_price,item_cnt_day
count,100000.0,100000.000000,100000.000000,100000.000000,100000.000000
mean,0.0,27.453980,10307.291950,705.947775,1.141810
std,0.0,16.846122,6312.458956,1233.420045,0.693905
min,0.0,0.000000,19.000000,9.000000,-6.000000
25%,0.0,16.000000,4481.000000,199.000000,1.000000
50%,0.0,27.000000,9906.000000,398.000000,1.000000
75%,0.0,35.000000,15675.250000,699.000000,1.000000
max,0.0,59.000000,22168.000000,32990.000000,64.000000

In [29]:
shops = '/home/vant/Escritorio/ProyectosKaggle/shops.csv'

In [31]:
%%time
!cat {shops}|wc -l

61
CPU times: user 6.41 ms, sys: 3.99 ms, total: 10.4 ms
Wall time: 115 ms

In [33]:
pd.options.display.max_columns=None
dfsh = pd.read_csv(shops)
dfsh.tail() #it is not important data, only names of shops in russian

                   shop_name  shop_id
55  Цифровой склад 1С-Онлайн       55
56      Чехов ТРЦ "Карнавал"       56
57   Якутск Орджоникидзе, 56       57
58   Якутск ТЦ "Центральный"       58
59    Ярославль ТЦ "Альтаир"       59

In [34]:
itemscat = '/home/vant/Escritorio/ProyectosKaggle/item_categories.csv'

In [35]:
%%time
!cat {itemscat} |wc -l

85
CPU times: user 5.75 ms, sys: 4.04 ms, total: 9.79 ms
Wall time: 115 ms

In [39]:
pd.options.display.max_columns=None
dfit_cat = pd.read_csv(itemscat)
dfit_cat.head(10) #at least first items are consoles but again in russian... I don't understand anything

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4
5      Аксессуары - PSVita                 5
6    Аксессуары - XBOX 360                 6
7    Аксессуары - XBOX ONE                 7
8           Билеты (Цифра)                 8
9          Доставка товара                 9

In [40]:
items = '/home/vant/Escritorio/ProyectosKaggle/items.csv'

In [41]:
%%time
!cat {items} |wc -l

22171
CPU times: user 2.58 ms, sys: 8.03 ms, total: 10.6 ms
Wall time: 117 ms

In [43]:
pd.options.display.max_columns=None
dfit = pd.read_csv(items)
dfit.head() #it could be good data for clustering items but without understanding each category...

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [44]:
sample_sub = '/home/vant/Escritorio/ProyectosKaggle/sample_submission.csv.gz'

In [45]:
%%time
!zcat {sample_sub} |wc -l

214201
CPU times: user 3.08 ms, sys: 16 ms, total: 19.1 ms
Wall time: 137 ms

In [56]:
pd.options.display.max_columns=None
dfsample = pd.read_csv(sample_sub)
dfsample.tail(5)

            ID  item_cnt_month
214195  214195             0.5
214196  214196             0.5
214197  214197             0.5
214198  214198             0.5
214199  214199             0.5

In [61]:
dfsample1 = dfsample[dfsample['item_cnt_month'] == 0.5]
dfsample1.count() #it seems the whole df is 0.5, it doesn't help

ID                214200
item_cnt_month    214200
dtype: int64